#include <iostream>
using namespace std;

//Дано масив A розміру N і ціле число K (1 ≤ K ≤ N). Вивести елементи масиву з 
//порядковими номерами, кратними K. Умовний оператор не використовувати. 
bool check_task_1(int N, int K) //перевірка вхідних даних на правельність
{
    bool check_N, check_K; //декларація змінних
    
    if ((N > 0) && (K >= 1) && (K <= N) && (K % 1 == 0)) //перевіряємо, чи обидві змінні були введені згіно з обмеженнями
    {
        check_N = true;
        check_K = true;
    }
    else
    {
        check_N = false;
        check_K = false;
    }
    
    if ((check_N == true) && (check_K == true)) //якщо перевірка на правельність завершилися успіхом - повертаємося до виконання, а якщо ні - виходимо з виконання завдання для вказаних даних
        return true;
    else
    {
        cout << "Було введено неправильні дані!" << endl;
        return false;
    }
    
}

void present_array_A(int A[], int N) //виводимо масив А в рядок за зростаючими номерами елементів
{
    cout << "Елементи масиву А: " <<  endl;
    
    for (int i = 0; i < N; i++)
    {
        cout << A[i] << " ";
    }
    
    cout << endl;
}

void elementy_kratni_K(int A[], int N, int K) //виконуємо та виводимо результат умови завдання 1
{
    cout << "Елементи масиву, яких порядкові номери є кратними числа К: " << endl;
    
    for (int i = 0; i < N; i++)
    {
        if (i % K == 0)
            cout << A[i] << " ";
    }
    
    cout << endl;
}

void task_1() //виконання завдання 1
{
    int N, K; //декларація відповідних змінних
    int A[N];
    int t = 0; //ця змінна не була вказана в завданні, проте вона потрібна для того, щоби тоді не було нескінченого виконування while()
    
    cout << "Введіть значення кількості елементів масиву: "; //введення кількості елементів масиву А
    cin >> N;
    
    cout << "Введіть значення числа К: "; //введення вартості змінної К
    cin >> K;

    while ((check_task_1(N, K) == true) && (t == 0))
    {
        for (int i = 0; i < N; i++)
        {
            cout << "Element A[" << i << "]: ";
            cin >> A[i];
        }
        
        cout << endl;
        
        present_array_A(A, N);
        
        elementy_kratni_K(A, N, K);
        
        t = t + 1;
    }
    
    cout << endl;
}

//Дан масив розміру N і два цілих числа K і M (1 ≤ K ≤ N, 1 ≤ M ≤ 10). Перед 
//елементом масиву з номером K вставити M нових елементів з нульовими 
//значеннями. 
bool check_task_2(int N, int K, int M) //перевіряємо, чи обидві змінні були введені згіно з обмеженнями
{
    bool check_N, check_K, check_M; //декларація змінних

    if ((N > 0) && (K >= 1) && (K <= N) && (K % 1 == 0) && (M >= 1) && (M <= 10)) //перевіряємо, чи всі три змінні були введені згіно з обмеженнями
    {
        check_N = true;
        check_K = true;
        check_M = true;
    }
    else
    {
        check_N = false;
        check_K = false;
        check_M = false;
    }
    
    if ((check_N == true) && (check_K == true) && (check_M == true)) //якщо перевірка на правельність завершилися успіхом - повертаємося до виконання, а якщо ні - виходимо з виконання завдання для вказаних даних
        return true;
    else
    {
        cout << "Було введено неправильні дані!" << endl;
        return false;
    }
}

void present_array(int B[], int N) //виводимо заданий масив
{
    cout << "Елементи масиву B: " <<  endl;
    
    for (int i = 0; i < N; i++)
    {
        cout << B[i] << " ";
    }
    
    cout << endl;
}

void zminenyy_array(int B[], int N, int K, int M) //модифікуємо заданий масив згідно з умовою завдання 
{
    int C[M]; //декларація потрібних змінних
    int s = K;
    
    cout << "Модифікований масив: " << endl;
    
    for (int i = 0; i < K; i++) //виводимо елементи, які знаходяться до елементу під номером К
        cout << B[i] << " ";
    
    for (int j = 0; j < (N - K); j++) //записуємо вартість відповідних елементів (без забурення їхньої черги) під номером від К до останнього елементу масиву 
    {
        C[j] = B[s];
        s = s + 1;
    }
    
    for (int l = K; l < (K + M); l++) //вставляємо відповідну кількість разів (М) елемент зі значенням 0
    {
        B[l] = 0;
        cout << B[l] << " ";
    }
    
    for (int y = 0; y < (N - K); y++) //дописуємо до модифікованого масиву елементи, які були після елементу під номером (К - 1) в оригінальному вигляді масиву
        cout << C[y] << " ";
    
    cout << endl;
}

void task_2() //виконання завдання 2
{
    int N, K, M; //декларація необхідних змінних
    int B[N];
    int x = 0; //ця змінна не була вказана в завданні, проте вона потрібна для того, щоби тоді не було нескінченого виконування while()
    
    cout << "Введіть значення кількості елементів масиву: "; //введення кількості елементів масиву
    cin >> N;
    
    cout << "Введіть значення числа К: "; //введення значення числа К
    cin >> K;
    
    cout << "Введіть значення числа M: "; //введення значення числа М
    cin >> M;
    
    while ((check_task_2(N, K, M) == true) && (x == 0))
    {
        for (int i = 0; i < N; i++)
        {
            cout << "Element B[" << i << "]: ";
            cin >> B[i];
        }
        
        cout << endl;
        
        present_array(B, N);
        
        zminenyy_array(B, N, K, M);
        
        x = x + 1;
    }
    
    cout << endl;
}

int main() //алгоритм головного меню
{
    int num_menu; //декларація змінної зі значенням завдання до виконання
    
    do 
    {
        cout << "Введіть номер завдання до виконання: ";
        cin >> num_menu;
        
        switch (num_menu)
        {
            case 1: task_1(); break;
            case 2: task_2(); break;
            case 0: cout << "Закінчення виконання завдань!" << endl; break; //в разі введення в консоль вартості 0, буде закінчено алгоритм зчитування та виконання завдань
            default: cout << "Wrong task!" << endl;
        }
    }
    while (num_menu != 0);
    
    cout << endl;
    
    return 0;
}